
* Script.py

#+begin_src python :results output
import pandas as pd
import numpy as np

# Read in the `clicks.csv` file as `abdata`
abdata = pd.read_csv('clicks.csv')

# Inspect the database
print(abdata.head())

# Create a contingency table with pd.crosstab
Xtab = pd.crosstab(abdata.group, abdata.is_purchase)
print(Xtab)

# Import the Chi-Square contingency module
from scipy.stats import chi2_contingency

# Calculate the p-value
chi2, pval, dof, expected = chi2_contingency(Xtab)

# Print the p-value
print(pval)

# Determine if the p-value is significant
is_significant = True

# Calculate and print the number of visits
num_visits = len(abdata)

# Print the number of visits
print(num_visits)

# Calculate the purchase rate needed at 0.99
num_sales_needed_099 = 1000/0.99
print('Num sales needed at 0.99: ', num_sales_needed_099)

p_sales_needed_099 = num_sales_needed_099 / num_visits
print('Proportion of the visits being actual purchases at 0.99: ', p_sales_needed_099)

# Calculate the purchase rate needed at 1.99
num_sales_needed_199 = 1000/1.99
print('Num sales needed at 1.99: ', num_sales_needed_199)

p_sales_needed_199 = num_sales_needed_199 / num_visits
print('Proportion of the visits being actual purchases at 1.99: ', p_sales_needed_199)

# Calculate the purchase rate needed at 4.99
num_sales_needed_499 = 1000/4.99
print('Num sales needed at 4.99: ', num_sales_needed_499)

p_sales_needed_499 = num_sales_needed_499 / num_visits
print('Proportion of the visits being actual purchases at 4.99: ', p_sales_needed_499)

# Calculate the sample size & sales for 0.99 price point
samp_size_099 = np.sum(abdata.group == 'A')
sales_099 = np.sum((abdata.group == 'A') & (abdata.is_purchase == 'Yes'))

# Print sample size & sales for 0.99 price point
print('sample size for 0.99: ', samp_size_099)
print('sales for 0.99: ', sales_099)

# Calculate the sample size & sales for 1.99 price point
samp_size_199 = np.sum(abdata.group == 'B')
sales_199 = np.sum((abdata.group == 'B') & (abdata.is_purchase == 'Yes'))

# Print sample size & sales for 0.99 price point
print('sample size for 1.99: ', samp_size_199)
print('sales for 1.99: ', sales_199)

# Calculate the sample size & sales for 4.99 price point
samp_size_499 = np.sum(abdata.group == 'C')
sales_499 = np.sum((abdata.group == 'C') & (abdata.is_purchase == 'Yes'))

# Print sample size & sales for 0.99 price point
print('sample size for 4.99: ', samp_size_499)
print('sales for 4.99: ', sales_499)
print('\n')
# Import the binom test module
from scipy.stats import binomtest

# Calculate the pvalue for Group A
pvalueA = binomtest(sales_099, n=samp_size_099, p=p_sales_needed_099, alternative='greater')

print('Observed purchase significantly greater for Group A?: ', pvalueA)
print('\n')
# Calculate the pvalue for Group B
pvalueB = binomtest(sales_199, n=samp_size_199, p=p_sales_needed_199, alternative='greater')
print('Observed purchase significantly greater for Group B?: ', pvalueB)
print('\n')
# Calculate the pvalue for Group C
pvalueC = binomtest(sales_499, n=samp_size_499, p=p_sales_needed_499, alternative='greater')
print('Observed purchase significantly greater for Group C?: ', pvalueC)

#+end_src

#+RESULTS:
#+begin_example
    user_id group is_purchase
0  8e27bf9a     A          No
1  eb89e6f0     A          No
2  7119106a     A          No
3  e53781ff     A          No
4  02d48cf1     A         Yes
is_purchase    No  Yes
group                 
A            1350  316
B            1483  183
C            1583   83
2.4126213546684264e-35
4998
Num sales needed at 0.99:  1010.1010101010102
Proportion of the visits being actual purchases at 0.99:  0.20210104243717691
Num sales needed at 1.99:  502.51256281407035
Proportion of the visits being actual purchases at 1.99:  0.10054272965467594
Num sales needed at 4.99:  200.40080160320642
Proportion of the visits being actual purchases at 4.99:  0.040096198800161346
sample size for 0.99:  1666
sales for 0.99:  316
sample size for 1.99:  1666
sales for 1.99:  183
sample size for 4.99:  1666
sales for 4.99:  83


Observed purchase significantly greater for Group A?:  BinomTestResult(k=316, n=1666, alternative='greater', statistic=0.18967587034813926, pvalue=0.9028081076188554)


Observed purchase significantly greater for Group B?:  BinomTestResult(k=183, n=1666, alternative='greater', statistic=0.10984393757503001, pvalue=0.11184562623740596)


Observed purchase significantly greater for Group C?:  BinomTestResult(k=83, n=1666, alternative='greater', statistic=0.04981992797118848, pvalue=0.027944826659830616)
#+end_example
